PeterVranken/TRK-USB-MPC5643L/LSM/printf/code/serial/sio_serialIO.c
        /* Start DMA only if there's no currently running transfer (from a write of
           before). If there is such a running transfer then the next transfer will be
           initiated from its on-complete-interrupt. */
        if(noBytes > 0  &&  !_serialOutDmaTransferIsRunning)
        {
            /* Set the number of bytes to transfer by DMA to the UART. */
            assert((unsigned)noBytes <= SERIAL_OUTPUT_RING_BUFFER_SIZE-1);
            EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER = noBytes;
            EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER = noBytes;

            /* Enable the DMA channel to accept the UART's requests for bytes. This
               initiates a DMA transfer.
                 NOP, 0x80: 1: Ignore write to register (to permit 32 Bit access to more
               than one of these byte registers at a time)
                 SERQ0, 0x40: 0: Address channel with SERQ, 1: Enable all channels
                 SERQ, 0xf: Channel number */
            atomic_thread_fence(memory_order_seq_cst);
            ++ sio_serialOutNoDMATransfers;
            EDMA.DMASERQ.R = DMA_CHN_FOR_SERIAL_OUTPUT;

            /* The status, whether we have currently started a transfer or not is shared
               with the on-complete-interrupt. */
            _serialOutDmaTransferIsRunning = true;
        }
#undef MODULO
    }
    ihw_leaveCriticalSection(msr);
    
    /* noBytes is saturated to buffer size-1 and can't overflow in conversion to signed. */
    return (signed int)noBytes;
    
} /* End of sio_writeSerial */




/**
 * Application API function to read a single character from serial input or EOF if there's
 * no such character received meanwhile.
 *   @return
 * The function is non-blocking. If the receive buffer currently contains no character it
 * returns EOF (-1). Otherwise it returns the earliest received character, which is still
 * in the buffer.
 *   @remark
 * The return of EOF does not mean that the stream has been closed. It's just a matter of
 * having no input data temporarily. On reception of the more characters the function will
 * continue to return them.
 */
signed int sio_getchar()
{
    signed int c;
    
    /* Reading the ring buffer is done in critical section get ensure mutiual exclusion
       with the it filling interrupt. */
    uint32_t msr = ihw_enterCriticalSection();
    {
        /* Check for buffer empty. */
        if(_pRdSerialInRingBuf != _pWrSerialInRingBuf)
        {
            c = *_pRdSerialInRingBuf;

            /* Keep track of the received but not yet consumed end of line characters. (The
               variable is incremented on reception of such a character.) */
            if(c == '\n')
            {
                assert(_serialInNoEOL > 0);
                -- _serialInNoEOL;
            }

            /* Update read position in the ring buffer. This is at the same time the indication
               towards the interrupt of having the character consumed. */
            volatile uint8_t * const pRdTmp = _pRdSerialInRingBuf;
            _pRdSerialInRingBuf = pRdTmp < _pEndSerialInRingBuf ? pRdTmp+1 
                                                                : &_serialInRingBuf[0];
        }
        else    
        {
            /* Nothing in buffer, return EOF. */
            c = -1;
        }
    }
    ihw_leaveCriticalSection(msr);

    return c;

} /* End of sio_getchar */


#if 0
/// @todo Let the write API with file ID become part of the printf compilation unit
signed int write(int file, const void *msg, size_t noBytes)
{
    /// @todo Do we need EOL conversion? Likely yes
    /// @todo Write elipsis (...) in case of buffer-full caused truncation. This requires beforehand computation of possible length
    
    if(noBytes == 0  ||  msg == NULL  ||  (file != stdout->_file  &&  file != stderr->_file))
        return 0;
    else
        return sio_writeSerial(msg, noBytes);
        
} /* End of write */


unsigned long sio_read_noInvocations = 0;
int sio_read_fildes = -99;
void *sio_read_buf = (void*)-99;
size_t sio_read_nbytes = 99;
unsigned int sio_read_noErrors = 0
           , sio_read_noLostBytes = 0;

/// @todo This API belongs into the printf module. We need a raw read char or read line
ssize_t read(int fildes, void *buf, size_t nbytes)
{
    ++ sio_read_noInvocations;
    sio_read_fildes = fildes;
    sio_read_buf = buf;
    sio_read_nbytes = nbytes;

    ssize_t result;
    uint32_t msr = ihw_enterCriticalSection();
    {
        const unsigned int noCharsReceived = (unsigned int)(_pRdBuf - &_readBuf[0]);
        assert(noCharsReceived <= sizeof(_readBuf));
        
        /* Normally the clib request a maximum of data, so that the error situation of
           having more characters received as requested will normally not happen. */
        if(nbytes < noCharsReceived)
        {
            ++ sio_read_noErrors;
            sio_read_noLostBytes += noCharsReceived - nbytes;
        }
        
        if(nbytes > 0  &&  noCharsReceived == 0)
        {
            /* Catch the case, which is not intended by the blocking clib function: We need
               but we don't have any character. We return an error code. If we simply
               return 0 bytes the clib will not come back to ask later for more
               characters.
                 Note, this attempt to make the clib patiently waiting for later input
               doesn't work neither. Its internal buffer handling seems to be corrupted,
               the character strings returned to gets depend on our data but is not the
               same; fragments are repeated, instead of returning nothing.
                 Incorrect work around: We return an EOL, which actually isn't in the
               stream. Some input functions from the clib will return the empty string,
               which is s bit of correct. */
            *(char*)buf = '\n';
            result = 1;
        }
        else if(nbytes == 0)
            result = 0;
        else
        {
            if(nbytes > noCharsReceived)
                nbytes = noCharsReceived;

            /* Extract data and clear buffer. */
            memcpy(buf, (const void*)&_readBuf[0], nbytes);
            _pRdBuf = &_readBuf[0];
            _serialInNoEOL = 0;
            
            result = (ssize_t)nbytes;
        }
    }
    ihw_leaveCriticalSection(msr);

    return result;

} /* End of read */
#endif



